L(市区）＝69.55+26.16lgf-13.82lgh1+(44.9-6.55lgh1)lgd-a(h2)-s(a)
L(郊区)=64.15+26.16lgf-2[lg(f/28)]2-13.82lgh1+(44.9-6.55lgh1)lgd-a(h2)
L(乡村公路)=46.38+35.33lgf-[lg(f/28)]2-2.39(lgf)2-13.82lgh1+(44.9-6.55lgh1)lgd-a(h2)
L(开阔区)=28.61+44.49lgf-4.87(lgf)2-13.82lgh1+(44.9-6.55lgh1)lgd-a(h2)
L(林区)=69.55+26.16lgf-13.82lgh1+(44.9-6.55lgh1)lgd-a(h2)


其中：

f----工作频率，MHz
h1---基站天线高度，m
h2---移动台天线高度，m
d----到基站的距离，km
a(h2)---移动台天线高度增益因子，dB
a(h2)=(1.1lgf-0.7)h2-1.56lgf+0.8(中，小城市)
=3.2[lg(11.75h2)]2-4.97(大城市)
s(a)---市区建筑物密度修正因子，dB;
s(a)=30-25lga (5%<a≤50%)
=20+0.19lga-15.6(lga)2 (1%<a≤5%)
=20 (a≤1%)

 

 

>> f=900;
h1=30;
h2=1;
d=1:0.01:5;
ah2=3.2.*log10(11.75.*h2).^2-4.97;
a=20;
sa=20;
l=69.55+26.16.*log10(f)-13.82.*log10(h1)+(44.9-6.55.*log(h1)).*log(d)-ah2-sa;
plot(d,l)